/*
Γράψτε ένα πρόγραμμα που δηλώνει δύο μεταβλητές ακεραίων
num1 και num2 και αποθηκεύει το αποτέλεσμα της πρόσθεσης
 num1 + num2 στην μεταβλητή sum. Στη συνέχεια εκτυπώνει
 με println το εξής κείμενο: Το αποτέλεσμα της πρόσθεσης
  είναι ίσο με [το αποτέλεσμα της πρόσθεσης]

Δοκιμαστικά Δεδομένα: num1 = 19 και num2 = 30
Αναμενόμενα Αποτέλεσμα: 49
 */
package ergasiesJava.ch1;

public class SumApp {
    public static void main(String[] args) {
        int num1 = 29;
        int num2 = 10;
        int sum = 0;

        sum = num1 + num2;

        System.out.println("Το αποτέλεσμα της πρόσθεσης είναι ίσο με " + sum);
    }
}
